experiments/data/stats/ycsb_f_run3.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadf -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 14434
[OVERALL], Throughput(ops/sec), 69280.86462519052
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 44
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3048358043508383
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 44
[TOTAL_GC_TIME_%], Time(%), 0.3048358043508383
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3322880.0
[CLEANUP], MinLatency(us), 3321856
[CLEANUP], MaxLatency(us), 3323903
[CLEANUP], 50thPercentileLatency(us), 3323903
[CLEANUP], 95thPercentileLatency(us), 3323903
[CLEANUP], 99thPercentileLatency(us), 3323903
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.775958
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 25807
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 15
[INSERT], 99thPercentileLatency(us), 22
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadf -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 25930
[OVERALL], Throughput(ops/sec), 38565.368299267255
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 44
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.16968762051677594
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 44
[TOTAL_GC_TIME_%], Time(%), 0.16968762051677594
[READ], Operations, 1000000
[READ], AverageLatency(us), 14.962602
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 4119
[READ], 50thPercentileLatency(us), 13
[READ], 95thPercentileLatency(us), 52
[READ], 99thPercentileLatency(us), 72
[READ], Return=OK, 1000000
[READ-MODIFY-WRITE], Operations, 499320
[READ-MODIFY-WRITE], AverageLatency(us), 29.037370824321076
[READ-MODIFY-WRITE], MinLatency(us), 8
[READ-MODIFY-WRITE], MaxLatency(us), 36223
[READ-MODIFY-WRITE], 50thPercentileLatency(us), 26
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 73
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 96
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 39280.0
[CLEANUP], MinLatency(us), 39264
[CLEANUP], MaxLatency(us), 39295
[CLEANUP], 50thPercentileLatency(us), 39295
[CLEANUP], 95thPercentileLatency(us), 39295
[CLEANUP], 99thPercentileLatency(us), 39295
[UPDATE], Operations, 499320
[UPDATE], AverageLatency(us), 13.248169510534327
[UPDATE], MinLatency(us), 6
[UPDATE], MaxLatency(us), 33983
[UPDATE], 50thPercentileLatency(us), 12
[UPDATE], 95thPercentileLatency(us), 21
[UPDATE], 99thPercentileLatency(us), 27
[UPDATE], Return=OK, 499320